package com.les.ls.utils;

import de.odysseus.staxon.json.JsonXMLConfig;
import de.odysseus.staxon.json.JsonXMLConfigBuilder;
import de.odysseus.staxon.json.JsonXMLInputFactory;
import de.odysseus.staxon.xml.util.PrettyXMLEventWriter;

import javax.xml.stream.XMLEventReader;
import javax.xml.stream.XMLEventWriter;
import javax.xml.stream.XMLOutputFactory;
import java.io.IOException;
import java.io.StringReader;
import java.io.StringWriter;

public class JsonToXml {
    public static void main(String[] args) {
        String json = "{\"root\":{\"data\":[{\"交易日期\":\"20210625\",\"备注一\":\"--\",\"交易笔数\":\"10\",\"商户流水号\":\"\",\"项目号\":\"\",\"交易金额\":\"2.00\",\"发卡行通道\":\"微信\",\"记账日期\":\"20210625\",\"交易类型\":\"\",\"基本户\":\"\",\"银行流水号\":\"1010115061624591900896523\",\"结算金额\":\"2.00\",\"订单金额\":\"2.00\",\"付款方户名\":\"****\",\"授权号\":\"\",\"支付卡种\":\"其他卡种\",\"交易时间\":\"2021-06-25 11:31:40\",\"柜台代码\":\"055082667\",\"付款方账号客户号\":\"***************8888\",\"备注二\":\"--\",\"订单号\":\"105000280110802162459188632263\",\"手续费\":\"0.00\",\"出单日期\":\"20210625\",\"期数\":\"1\",\"订单状态\":\"成功\"},{\"交易日期\":\"20210625\",\"备注一\":\"--\",\"交易笔数\":\"10\",\"商户流水号\":\"\",\"项目号\":\"\",\"交易金额\":\"1.48\",\"发卡行通道\":\"微信\",\"记账日期\":\"20210625\",\"交易类型\":\"\",\"基本户\":\"\",\"银行流水号\":\"1010113821624592086605959\",\"结算金额\":\"1.48\",\"订单金额\":\"1.48\",\"付款方户名\":\"****\",\"授权号\":\"\",\"支付卡种\":\"其他卡种\",\"交易时间\":\"2021-06-25 11:34:46\",\"柜台代码\":\"055082667\",\"付款方账号客户号\":\"***************8888\",\"备注二\":\"--\",\"订单号\":\"105000280110802162459207807231\",\"手续费\":\"0.00\",\"出单日期\":\"20210625\",\"期数\":\"1\",\"订单状态\":\"成功\"},{\"交易日期\":\"20210625\",\"备注一\":\"--\",\"交易笔数\":\"10\",\"商户流水号\":\"2021062511917879\",\"项目号\":\"\",\"交易金额\":\"-1.48\",\"发卡行通道\":\"微信\",\"记账日期\":\"20210625\",\"交易类型\":\"\",\"基本户\":\"\",\"银行流水号\":\"1010029081624592965827307\",\"结算金额\":\"-1.48\",\"订单金额\":\"1.48\",\"付款方户名\":\"****\",\"授权号\":\"\",\"支付卡种\":\"其他卡种\",\"交易时间\":\"2021-06-25 11:49:25\",\"柜台代码\":\"055082667\",\"付款方账号客户号\":\"***************8888\",\"备注二\":\"--\",\"订单号\":\"105000280110802162459207807231\",\"手续费\":\"0.00\",\"出单日期\":\"20210625\",\"期数\":\"1\",\"订单状态\":\"成功\"},{\"交易日期\":\"20210625\",\"备注一\":\"--\",\"交易笔数\":\"10\",\"商户流水号\":\"2021062511457894\",\"项目号\":\"\",\"交易金额\":\"-2.00\",\"发卡行通道\":\"微信\",\"记账日期\":\"20210625\",\"交易类型\":\"\",\"基本户\":\"\",\"银行流水号\":\"1010029141624593079235007\",\"结算金额\":\"-2.00\",\"订单金额\":\"2.00\",\"付款方户名\":\"****\",\"授权号\":\"\",\"支付卡种\":\"其他卡种\",\"交易时间\":\"2021-06-25 11:51:19\",\"柜台代码\":\"055082667\",\"付款方账号客户号\":\"***************8888\",\"备注二\":\"--\",\"订单号\":\"105000280110802162459188632263\",\"手续费\":\"0.00\",\"出单日期\":\"20210625\",\"期数\":\"1\",\"订单状态\":\"成功\"},{\"交易日期\":\"20210625\",\"备注一\":\"--\",\"交易笔数\":\"10\",\"商户流水号\":\"\",\"项目号\":\"\",\"交易金额\":\"2.00\",\"发卡行通道\":\"微信\",\"记账日期\":\"20210625\",\"交易类型\":\"\",\"基本户\":\"\",\"银行流水号\":\"1010115151624602133638714\",\"结算金额\":\"2.00\",\"订单金额\":\"2.00\",\"付款方户名\":\"****\",\"授权号\":\"\",\"支付卡种\":\"其他卡种\",\"交易时间\":\"2021-06-25 14:22:14\",\"柜台代码\":\"055082667\",\"付款方账号客户号\":\"***************8888\",\"备注二\":\"--\",\"订单号\":\"105000280110802162460211173538\",\"手续费\":\"0.00\",\"出单日期\":\"20210625\",\"期数\":\"1\",\"订单状态\":\"成功\"},{\"交易日期\":\"20210625\",\"备注一\":\"--\",\"交易笔数\":\"10\",\"商户流水号\":\"\",\"项目号\":\"\",\"交易金额\":\"5.18\",\"发卡行通道\":\"微信\",\"记账日期\":\"20210625\",\"交易类型\":\"\",\"基本户\":\"\",\"银行流水号\":\"1010114541624602221548258\",\"结算金额\":\"5.18\",\"订单金额\":\"5.18\",\"付款方户名\":\"****\",\"授权号\":\"\",\"支付卡种\":\"其他卡种\",\"交易时间\":\"2021-06-25 14:23:41\",\"柜台代码\":\"055082667\",\"付款方账号客户号\":\"***************8888\",\"备注二\":\"--\",\"订单号\":\"105000280110802162460220630720\",\"手续费\":\"0.00\",\"出单日期\":\"20210625\",\"期数\":\"1\",\"订单状态\":\"成功\"},{\"交易日期\":\"20210625\",\"备注一\":\"--\",\"交易笔数\":\"10\",\"商户流水号\":\"\",\"项目号\":\"\",\"交易金额\":\"2.00\",\"发卡行通道\":\"微信\",\"记账日期\":\"20210625\",\"交易类型\":\"\",\"基本户\":\"\",\"银行流水号\":\"1010115171624602287801994\",\"结算金额\":\"2.00\",\"订单金额\":\"2.00\",\"付款方户名\":\"****\",\"授权号\":\"\",\"支付卡种\":\"其他卡种\",\"交易时间\":\"2021-06-25 14:24:47\",\"柜台代码\":\"055082667\",\"付款方账号客户号\":\"***************8888\",\"备注二\":\"--\",\"订单号\":\"105000280110802162460227371464\",\"手续费\":\"0.00\",\"出单日期\":\"20210625\",\"期数\":\"1\",\"订单状态\":\"成功\"},{\"交易日期\":\"20210625\",\"备注一\":\"--\",\"交易笔数\":\"10\",\"商户流水号\":\"\",\"项目号\":\"\",\"交易金额\":\"9.99\",\"发卡行通道\":\"微信\",\"记账日期\":\"20210625\",\"交易类型\":\"\",\"基本户\":\"\",\"银行流水号\":\"1010114131624602420757727\",\"结算金额\":\"9.99\",\"订单金额\":\"9.99\",\"付款方户名\":\"****\",\"授权号\":\"\",\"支付卡种\":\"其他卡种\",\"交易时间\":\"2021-06-25 14:27:00\",\"柜台代码\":\"055082667\",\"付款方账号客户号\":\"***************8888\",\"备注二\":\"--\",\"订单号\":\"105000280110802162460240533175\",\"手续费\":\"0.00\",\"出单日期\":\"20210625\",\"期数\":\"1\",\"订单状态\":\"成功\"},{\"交易日期\":\"20210625\",\"备注一\":\"--\",\"交易笔数\":\"10\",\"商户流水号\":\"2021062514605280\",\"项目号\":\"\",\"交易金额\":\"-9.99\",\"发卡行通道\":\"微信\",\"记账日期\":\"20210625\",\"交易类型\":\"\",\"基本户\":\"\",\"银行流水号\":\"1010029111624602590862366\",\"结算金额\":\"-9.99\",\"订单金额\":\"9.99\",\"付款方户名\":\"****\",\"授权号\":\"\",\"支付卡种\":\"其他卡种\",\"交易时间\":\"2021-06-25 14:29:50\",\"柜台代码\":\"055082667\",\"付款方账号客户号\":\"***************8888\",\"备注二\":\"--\",\"订单号\":\"105000280110802162460240533175\",\"手续费\":\"0.00\",\"出单日期\":\"20210625\",\"期数\":\"1\",\"订单状态\":\"成功\"},{\"交易日期\":\"20210625\",\"备注一\":\"--\",\"交易笔数\":\"10\",\"商户流水号\":\"2021062514075251\",\"项目号\":\"\",\"交易金额\":\"-2.00\",\"发卡行通道\":\"微信\",\"记账日期\":\"20210625\",\"交易类型\":\"\",\"基本户\":\"\",\"银行流水号\":\"1010029141624602695234022\",\"结算金额\":\"-2.00\",\"订单金额\":\"2.00\",\"付款方户名\":\"****\",\"授权号\":\"\",\"支付卡种\":\"其他卡种\",\"交易时间\":\"2021-06-25 14:31:35\",\"柜台代码\":\"055082667\",\"付款方账号客户号\":\"***************8888\",\"备注二\":\"--\",\"订单号\":\"105000280110802162460227371464\",\"手续费\":\"0.00\",\"出单日期\":\"20210625\",\"期数\":\"1\",\"订单状态\":\"成功\"}]}}";
        String xml = json2xml(json);
        System.out.println(xml);
    }

    public static String json2xml(String json) {
        StringReader input = new StringReader(json);
        StringWriter output = new StringWriter();
        JsonXMLConfig config = new JsonXMLConfigBuilder().multiplePI(false).repairingNamespaces(false).build();
        try {
            XMLEventReader reader = new JsonXMLInputFactory(config).createXMLEventReader(input);
            XMLEventWriter writer = XMLOutputFactory.newInstance().createXMLEventWriter(output);
            writer = new PrettyXMLEventWriter(writer);
            writer.add(reader);
            reader.close();
            writer.close();
        } catch (Exception e) {
            e.printStackTrace();
        } finally {
            try {
                output.close();
                input.close();
            } catch (IOException e) {
                e.printStackTrace();
            }
        }
        return output.toString();
    }
}
